import matplotlib.pyplot as plt
from wordcloud import WordCloud
import numpy as np

from itertools import chain
from collections import Counter
import pandas as pd

data_mid = {
    '耗电': 2861.852333,
    '游戏': 2341.688486,
    '更新': 2129.902380,
    '系统': 1897.040916,
    '显示': 1887.140383,
    '设置': 1779.583586,
    '视频': 1735.166313,
    '好看': 1642.004292,
    "发热": 1409.493257,
    '软件': 1398.549270,
    '卡顿': 1396.584182,
    '微信': 1346.085956,
    '打开': 1295.435737,
    "屏幕": 1271.235443,
    "电池": 1229.256231,
    "充电": 1209.322833,
    "漂亮": 1182.460011,
    "vivo": 1099.596074,
    "功能": 1071.693723,
    "声音": 1056.714485,
}

data_high = {
    "更新": 2168.732224,
    "系统": 2142.232339,
    "耗电": 2066.963360,
    "显示": 1996.718804,
    "游戏": 1962.877185,
    "视频": 1843.385829,
    "设置": 1783.322955,
    "微信": 1618.580133,
    "打开": 1562.074048,
    "屏幕": 1541.483175,
    "卡顿": 1489.850854,
    "x0000": 1442.431000,
    "软件": 1321.139637,
    "模式": 1298.797517,
    "功能": 1286.700385,
    "电池": 1268.087285,
    "好看": 1263.582409,
    "希望": 1258.399917,
    "发热": 1202.134227,
    "性能": 1186.638667
}

data_low = {
    "游戏": 1412.307763,
    "设置": 918.234787,
    "显示": 906.472354,
    "视频": 843.842659,
    "下载": 828.275362,
    "更新": 824.829861,
    "软件": 749.596684,
    "不到": 737.795940,
    "唤醒": 731.160945,
    "闪退": 704.806677,
    "广告": 618.496068,
    "耗电": 610.305294,
    "微信": 608.843295,
    "充电": 607.450993,
    "打开": 605.012067,
    "进不去": 571.230872,
    "功能": 566.891174,
    "声音": 549.548218,
    "卡顿": 541.745157,
    "屏幕": 539.157455
}
wc = WordCloud(font_path="C:\\Windows\\Fonts\\simsun.ttc",
               width=800,
               height=700,
               background_color='white')
wc.generate_from_frequencies(data_high)
wc.to_file("低端词云Tf-idf分析.png")
